# ####################################################################

#  Created by Genus(TM) Synthesis Solution 17.10-p007_1 on Sun May 08 17:25:54 BRT 2022

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design processador_6_instrucoes

create_clock -name "clk" -add -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_load -pin_load -min 0.0014 [get_ports {PC[15]}]
set_load -pin_load -max 0.32 [get_ports {PC[15]}]
set_load -pin_load -min 0.0014 [get_ports {PC[14]}]
set_load -pin_load -max 0.32 [get_ports {PC[14]}]
set_load -pin_load -min 0.0014 [get_ports {PC[13]}]
set_load -pin_load -max 0.32 [get_ports {PC[13]}]
set_load -pin_load -min 0.0014 [get_ports {PC[12]}]
set_load -pin_load -max 0.32 [get_ports {PC[12]}]
set_load -pin_load -min 0.0014 [get_ports {PC[11]}]
set_load -pin_load -max 0.32 [get_ports {PC[11]}]
set_load -pin_load -min 0.0014 [get_ports {PC[10]}]
set_load -pin_load -max 0.32 [get_ports {PC[10]}]
set_load -pin_load -min 0.0014 [get_ports {PC[9]}]
set_load -pin_load -max 0.32 [get_ports {PC[9]}]
set_load -pin_load -min 0.0014 [get_ports {PC[8]}]
set_load -pin_load -max 0.32 [get_ports {PC[8]}]
set_load -pin_load -min 0.0014 [get_ports {PC[7]}]
set_load -pin_load -max 0.32 [get_ports {PC[7]}]
set_load -pin_load -min 0.0014 [get_ports {PC[6]}]
set_load -pin_load -max 0.32 [get_ports {PC[6]}]
set_load -pin_load -min 0.0014 [get_ports {PC[5]}]
set_load -pin_load -max 0.32 [get_ports {PC[5]}]
set_load -pin_load -min 0.0014 [get_ports {PC[4]}]
set_load -pin_load -max 0.32 [get_ports {PC[4]}]
set_load -pin_load -min 0.0014 [get_ports {PC[3]}]
set_load -pin_load -max 0.32 [get_ports {PC[3]}]
set_load -pin_load -min 0.0014 [get_ports {PC[2]}]
set_load -pin_load -max 0.32 [get_ports {PC[2]}]
set_load -pin_load -min 0.0014 [get_ports {PC[1]}]
set_load -pin_load -max 0.32 [get_ports {PC[1]}]
set_load -pin_load -min 0.0014 [get_ports {PC[0]}]
set_load -pin_load -max 0.32 [get_ports {PC[0]}]
set_load -pin_load -min 0.0014 [get_ports I_rd]
set_load -pin_load -max 0.32 [get_ports I_rd]
set_false_path -from [get_ports reset]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -rise -min 0.0 [get_ports clk]
set_input_delay -clock [get_clocks clk] -clock_fall -network_latency_included -add_delay -fall -min 0.0 [get_ports clk]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports clk]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports reset]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {data[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {data[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {data[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {data[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {data[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {data[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {data[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {data[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {data[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {data[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {data[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {data[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {data[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {data[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {data[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {data[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports I_rd]
set_output_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {PC[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {PC[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {PC[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {PC[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {PC[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {PC[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {PC[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {PC[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {PC[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {PC[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {PC[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {PC[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {PC[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {PC[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {PC[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {PC[15]}]
set_input_transition -min 0.003 [get_ports clk]
set_input_transition -max 0.16 [get_ports clk]
set_input_transition -min 0.003 [get_ports reset]
set_input_transition -max 0.16 [get_ports reset]
set_input_transition -min 0.003 [get_ports {data[15]}]
set_input_transition -max 0.16 [get_ports {data[15]}]
set_input_transition -min 0.003 [get_ports {data[14]}]
set_input_transition -max 0.16 [get_ports {data[14]}]
set_input_transition -min 0.003 [get_ports {data[13]}]
set_input_transition -max 0.16 [get_ports {data[13]}]
set_input_transition -min 0.003 [get_ports {data[12]}]
set_input_transition -max 0.16 [get_ports {data[12]}]
set_input_transition -min 0.003 [get_ports {data[11]}]
set_input_transition -max 0.16 [get_ports {data[11]}]
set_input_transition -min 0.003 [get_ports {data[10]}]
set_input_transition -max 0.16 [get_ports {data[10]}]
set_input_transition -min 0.003 [get_ports {data[9]}]
set_input_transition -max 0.16 [get_ports {data[9]}]
set_input_transition -min 0.003 [get_ports {data[8]}]
set_input_transition -max 0.16 [get_ports {data[8]}]
set_input_transition -min 0.003 [get_ports {data[7]}]
set_input_transition -max 0.16 [get_ports {data[7]}]
set_input_transition -min 0.003 [get_ports {data[6]}]
set_input_transition -max 0.16 [get_ports {data[6]}]
set_input_transition -min 0.003 [get_ports {data[5]}]
set_input_transition -max 0.16 [get_ports {data[5]}]
set_input_transition -min 0.003 [get_ports {data[4]}]
set_input_transition -max 0.16 [get_ports {data[4]}]
set_input_transition -min 0.003 [get_ports {data[3]}]
set_input_transition -max 0.16 [get_ports {data[3]}]
set_input_transition -min 0.003 [get_ports {data[2]}]
set_input_transition -max 0.16 [get_ports {data[2]}]
set_input_transition -min 0.003 [get_ports {data[1]}]
set_input_transition -max 0.16 [get_ports {data[1]}]
set_input_transition -min 0.003 [get_ports {data[0]}]
set_input_transition -max 0.16 [get_ports {data[0]}]
set_wire_load_mode "segmented"
set_wire_load_selection_group "WireAreaForZero" -library "tcb018gbwp7ttc"
set_dont_use [get_lib_cells tcb018gbwp7ttc/BHDBWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GAN2D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GAN2D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GAOI21D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GAOI21D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GAOI22D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GBUFFD1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GBUFFD2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GBUFFD3BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GBUFFD8BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GDCAP10BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GDCAP2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GDCAP3BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GDCAP4BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GDCAPBWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GDFCNQD1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GDFQD1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GFILL10BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GFILL2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GFILL3BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GFILL4BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GFILLBWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GINVD1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GINVD2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GINVD3BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GINVD8BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GMUX2D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GMUX2D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GMUX2ND1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GMUX2ND2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GND2D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GND2D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GND2D3BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GND3D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GND3D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GNR2D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GNR2D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GNR3D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GNR3D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GOAI21D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GOAI21D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GOR2D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GOR2D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GSDFCNQD1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GTIEHBWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GTIELBWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GXNR2D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GXNR2D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GXOR2D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7ttc/GXOR2D2BWP7T]
